lucas-traumen/Weather-monitoring-station-IOT-/firmware/stm32/node_stm32_ver1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LORA_AUX_Pin GPIO_PIN_1
#define LORA_AUX_GPIO_Port GPIOA
#define LORA_TX_Pin GPIO_PIN_2
#define LORA_TX_GPIO_Port GPIOA
#define LORA_RX_Pin GPIO_PIN_3
#define LORA_RX_GPIO_Port GPIOA
#define LORA_M0_Pin GPIO_PIN_4
#define LORA_M0_GPIO_Port GPIOA
#define LORA_M1_Pin GPIO_PIN_5
#define LORA_M1_GPIO_Port GPIOA
#define TPS_PS_SYNC_Pin GPIO_PIN_6
#define TPS_PS_SYNC_GPIO_Port GPIOA
#define SOURCE_SCL_Pin GPIO_PIN_10
#define SOURCE_SCL_GPIO_Port GPIOB
#define SOURCE_SDA_Pin GPIO_PIN_11
#define SOURCE_SDA_GPIO_Port GPIOB
#define Print_TX_Pin GPIO_PIN_9
#define Print_TX_GPIO_Port GPIOA
#define Print_RX_Pin GPIO_PIN_10
#define Print_RX_GPIO_Port GPIOA
#define ENV_SCL_Pin GPIO_PIN_6
#define ENV_SCL_GPIO_Port GPIOB
#define ENV_SDA_Pin GPIO_PIN_7
#define ENV_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
